Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/disability_and_illness/disability_benefit.html.txt.tmx
Source language: en
Languages: ga

source: Note that in all cases social welfare medical certificates (MC1 and MC2) are not available online or from the Department's offices
ga: Níl ort íoc as teastas leighis leasa shóisialaigh de bharr go n-íocann an Roinn táille lenar comhaontaíodh leis an dochtúir

source: You are not required to pay for a social welfare medical certificate as the Department pays the doctor an agreed fee. However, you may have to pay for the medical examination
ga: Má bhíonn aon deacrachtaí agat an fhoirm a chomhlánú, beidh an fhoireann i d'oifig leasa shóisialaigh áitiúil sásta cabhrú leat

source: If you wish to make a backdated claim for Illness Benefit, you need to supply a First Medical Certificate (MC1) stating the date the illness began, a letter from your doctor giving details of your illness and treatment and a current MC2 certificate
ga: Ba chóir aon cheisteanna atá agat maidir le Sochar Breoiteachta a chur díreach chuig d'oifig leasa shóisialaigh áitiúil nó chuig Teileafón Fiosraithe faoi Sochar Breoiteachta (feach síos)

source: If you think you have been wrongly refused Illness Benefit, you can ask for the decision to be reviewed
ga: Má shíleann tú gur diúltaíodh go héagórach duit Sochar Breoiteachta a fháil, féadfaidh tú a iarraidh go ndéanfar athbhreithniú ar an gcinneadh

source: You can also appeal the decision to the Social Welfare Appeals Office, either straight away or after the review
ga: Ina theannta sin, féadfaidh tú achomharc a dhéanamh ar an gcinneadh leis an Oifig Achomhairc Leasa Shóisialaigh, cibé acu láithreach nó i ndiaidh an athbhreithnithe

source: You must request a review or appeal a decision within 21 days of being informed of the decision
ga: Ní mór duit athbhreithniú a iarraidh nó cinneadh a achomharc laistigh de 21 lá tar éis duit bheith ar an eolas faoin gcinneadh

source: Department of Social Protection
ga: An Roinn Coimirce Sóisialaí

source: You can email the Illness Benefit section using the secure enquiry form
ga: Is féidir leat ríomhphost don Rannóg Sochar Breoiteachta a sheoladh tríd an fhoirm fhiosraithe daingnithe Sochair Breoiteachta a úsáid
